YCSB-outputs/cassandra-exec-15-1000000-c-20-rf_2.txt
/usr/local/openjdk-11/bin/java -cp /opt/ycsb/slf4j-api-1.7.30.jar:/opt/ycsb/slf4j-simple-1.7.30.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.14.jar:/opt/ycsb/cassandra-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar:/opt/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/opt/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/opt/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/opt/ycsb/cassandra-binding/lib/cassandra-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar:/opt/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/opt/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/opt/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/opt/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar site.ycsb.Client -db site.ycsb.db.CassandraCQLClient -s -p hosts=10.0.2.5 -P /opt/ycsb/workloads/workloadc -p recordcount=1000000 -p rectime=3000 -p cassandra.connecttimeoutmillis=60000 -p cassandra.readtimeoutmillis=60000 -p cassandra.readconsistencylevel=ONE -p cassandra.writeconsistencylevel=ONE -p operationcount=10000 -t
Command line: -db site.ycsb.db.CassandraCQLClient -s -p hosts=10.0.2.5 -P /opt/ycsb/workloads/workloadc -p recordcount=1000000 -p rectime=3000 -p cassandra.connecttimeoutmillis=60000 -p cassandra.readtimeoutmillis=60000 -p cassandra.readconsistencylevel=ONE -p cassandra.writeconsistencylevel=ONE -p operationcount=10000 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2021-09-13 23:22:09:796 0 sec: 0 operations; est completion in 0 second 
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by io.netty.util.internal.PlatformDependent0 (file:/opt/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar) to field java.nio.Buffer.address
WARNING: Please consider reporting this to the maintainers of io.netty.util.internal.PlatformDependent0
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
[Thread-2] INFO io.netty.util.internal.PlatformDependent - Your platform does not provide complete low-level API for accessing direct buffers reliably. Unless explicitly requested, heap buffer will always be preferred to avoid potential system unstability.
[Thread-2] INFO com.datastax.driver.core.NettyUtil - Did not find Netty's native epoll transport in the classpath, defaulting to NIO.
[Thread-2] INFO com.datastax.driver.core.policies.DCAwareRoundRobinPolicy - Using data-center name 'datacenter1' for DCAwareRoundRobinPolicy (if this is incorrect, please provide the correct datacenter name with DCAwareRoundRobinPolicy constructor)
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.14:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.15:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.16:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.17:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.18:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.19:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.20:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.21:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.5:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.8:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.9:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.10:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.11:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.12:9042 added
[Thread-2] INFO com.datastax.driver.core.Cluster - New Cassandra host /10.0.2.13:9042 added
[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Connected to cluster: Test Cluster

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.14; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.15; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.16; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.17; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.18; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.19; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.20; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.21; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.5; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.8; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.9; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.10; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.11; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.12; Rack: rack1

[Thread-2] INFO site.ycsb.db.CassandraCQLClient - Datacenter: datacenter1; Host: /10.0.2.13; Rack: rack1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-09-13 23:22:19:749 10 sec: 0 operations; est completion in 106751991167300 days 15 hours 
2021-09-13 23:22:29:749 20 sec: 0 operations; est completion in 106751991167300 days 15 hours 
2021-09-13 23:22:39:749 30 sec: 0 operations; est completion in 106751991167300 days 15 hours 
2021-09-13 23:22:49:748 40 sec: 0 operations; est completion in 106751991167300 days 15 hours 
2021-09-13 23:22:59:748 50 sec: 0 operations; est completion in 106751991167300 days 15 hours 
2021-09-13 23:23:09:748 60 sec: 0 operations; est completion in 106751991167300 days 15 hours 
[cluster1-nio-worker-1] WARN com.datastax.driver.core.Connection - Timeout while setting keyspace on Connection[/10.0.2.5:9042-2, inFlight=1, closed=false]. This should not happen but is not critical (it will be retried)
2021-09-13 23:23:19:748 70 sec: 394 operations; 39.4 current ops/sec; est completion in 28 minutes [READ: Count=395, Max=60260351, Min=9240, Avg=172705.25, 90=29663, 99=43807, 99.9=60260351, 99.99=60260351] 
2021-09-13 23:23:29:748 80 sec: 1033 operations; 63.9 current ops/sec; est completion in 11 minutes [READ: Count=638, Max=37183, Min=7480, Avg=15586.39, 90=21855, 99=27519, 99.9=36895, 99.99=37183] 
2021-09-13 23:23:39:748 90 sec: 1715 operations; 68.2 current ops/sec; est completion in 7 minutes [READ: Count=683, Max=40223, Min=6664, Avg=14593.13, 90=20847, 99=28127, 99.9=35679, 99.99=40223] 
2021-09-13 23:23:49:749 100 sec: 2437 operations; 72.2 current ops/sec; est completion in 5 minutes [READ: Count=721, Max=50879, Min=6056, Avg=13795.36, 90=19679, 99=26527, 99.9=41375, 99.99=50879] 
2021-09-13 23:23:59:748 110 sec: 3189 operations; 75.2 current ops/sec; est completion in 3 minutes [READ: Count=752, Max=37919, Min=5976, Avg=13261.97, 90=19583, 99=25887, 99.9=33951, 99.99=37919] 
2021-09-13 23:24:09:748 120 sec: 3940 operations; 75.1 current ops/sec; est completion in 3 minutes [READ: Count=751, Max=29887, Min=6576, Avg=13272.62, 90=19295, 99=24271, 99.9=29151, 99.99=29887] 
2021-09-13 23:24:19:748 130 sec: 4730 operations; 79 current ops/sec; est completion in 2 minutes [READ: Count=790, Max=27775, Min=5540, Avg=12610.36, 90=18655, 99=25135, 99.9=26783, 99.99=27775] 
2021-09-13 23:24:29:749 140 sec: 5487 operations; 75.7 current ops/sec; est completion in 1 minute [READ: Count=758, Max=45919, Min=6116, Avg=13167.18, 90=19119, 99=28031, 99.9=41631, 99.99=45919] 
2021-09-13 23:24:39:748 150 sec: 6267 operations; 78 current ops/sec; est completion in 1 minute [READ: Count=779, Max=43167, Min=5676, Avg=12791.01, 90=18943, 99=27327, 99.9=41791, 99.99=43167] 
2021-09-13 23:24:49:748 160 sec: 7082 operations; 81.5 current ops/sec; est completion in 1 minute [READ: Count=815, Max=34143, Min=5516, Avg=12242.23, 90=18255, 99=24655, 99.9=30415, 99.99=34143] 
2021-09-13 23:24:59:748 170 sec: 7897 operations; 81.5 current ops/sec; est completion in 46 seconds [READ: Count=815, Max=27551, Min=5496, Avg=12241.9, 90=18031, 99=24559, 99.9=26991, 99.99=27551] 
2021-09-13 23:25:09:748 180 sec: 8688 operations; 79.1 current ops/sec; est completion in 28 seconds [READ: Count=791, Max=37407, Min=5088, Avg=12607.6, 90=18975, 99=26223, 99.9=32559, 99.99=37407] 
2021-09-13 23:25:19:748 190 sec: 9494 operations; 80.6 current ops/sec; est completion in 11 seconds [READ: Count=806, Max=35967, Min=5224, Avg=12388.24, 90=18351, 99=25775, 99.9=31631, 99.99=35967] 
2021-09-13 23:25:28:077 198 sec: 10000 operations; 60.76 current ops/sec; [READ: Count=506, Max=44383, Min=5772, Avg=12019.59, 90=18271, 99=27055, 99.9=32959, 99.99=44383] [CLEANUP: Count=1, Max=2248703, Min=2246656, Avg=2247680, 90=2248703, 99=2248703, 99.9=2248703, 99.99=2248703] 
[OVERALL], RunTime(ms), 198330
[OVERALL], Throughput(ops/sec), 50.42101547925175
[TOTAL_GCS_G1_Young_Generation], Count, 13
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 101
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.050925225634044266
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 13
[TOTAL_GC_TIME], Time(ms), 101
[TOTAL_GC_TIME_%], Time(%), 0.050925225634044266
[READ], Operations, 10000
[READ], AverageLatency(us), 19391.8098
[READ], MinLatency(us), 5088
[READ], MaxLatency(us), 60260351
[READ], 95thPercentileLatency(us), 22191
[READ], 99thPercentileLatency(us), 28415
[READ], Return=OK, 10000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2247680.0
[CLEANUP], MinLatency(us), 2246656
[CLEANUP], MaxLatency(us), 2248703
[CLEANUP], 95thPercentileLatency(us), 2248703
[CLEANUP], 99thPercentileLatency(us), 2248703